package com.coolpeace.domain.data.util;

import com.coolpeace.domain.accommodation.entity.type.AccommodationType;
import java.util.List;
import java.util.Map;
import java.util.Random;

public class InfoGenerator {

    private static List<String> accommodationPrefixPool = List.of(
        "로지", "브리즈", "코지", "스위트", "럭셔리", "모션", "터프", "하버", "마리나", "로드하우스", "레스토", "스테이", "러브",
        "퍼스트", "센트럴", "캠프", "세레니티", "에스케이프", "오아시스", "헤이븐", "캐슬", "엔더스", "워터프론트", "스파", "레트리트",
        "코튼", "블루스카이", "그린", "브루", "섀도우", "프리즘", "햇살", "포레스트", "세븐", "메이플", "트랜센던스", "몽고메리", "플로랄",
        "라이트", "트로피컬", "썬셋", "베이", "디럭스", "레드로즈", "피크닉", "엘리트", "블리스", "실버", "썬라이즈", "블랙다이아몬드",
        "프로미스", "샌드비치", "미스틱", "엑스클루시브", "피아노", "라운드", "민트", "로열", "몽바니", "스노우", "그레이스", "퍼펙트",
        "로즈우드", "트윈", "크리스탈", "미러",
        "그린비", "풍경", "하이츠", "데일리", "헤어핀", "엔티티", "루나", "아크", "포폴", "크로네", "아티컬", "더티", "레몬", "타임",
        "휴식", "힐스", "풋풋", "하이브", "스타일", "포르테", "이브", "히어로", "데코", "에코", "트레저", "허니", "크래프트", "미니",
        "메모리", "노스",
        "샬렛", "미니멀", "벨벳", "워니", "트렌디", "팜", "페스티벌", "라이즌", "스무드", "크림", "아티스트", "빈티지", "에어리",
        "알로하", "토파즈", "세르브", "미즈", "빈", "에피", "엠버", "씨블루", "플루토", "엔트로피", "네온", "프라임", "스플래시", "로드",
        "제니스", "아이스", "커버", "빅토리", "썬리치", "픽셀", "쿨링", "아리아", "엔젤", "프린세스", "펄", "트랙", "로켓", "선셋",
        "리버", "스카이", "컬러풀", "코지랜드", "모션픽", "더블루", "에메랄드", "포토", "루스", "세븐세븐", "바닐라", "메티스", "로프트",
        "써니", "루프", "스카이라인", "비스타", "아메리칸", "라디언트", "메디", "그린필드", "소울", "스윗플레이스", "패밀리", "아이엠",
        "오퍼스", "그로브", "듀얼", "올드", "제노시스", "리틀", "소피아", "플로어", "토마토", "하트", "로망틱", "스트라이크", "윈드",
        "퓨처", "블리", "원더",
        "모던", "미티", "로키", "브루클린", "트렌디플레이스", "레퍼런스", "미드나잇", "라이블리", "리얼", "포스", "스카니", "산장", "호수",
        "녹음", "천연", "경관", "소나무", "목장", "해변", "강변", "전망", "푸른하늘", "흰구름", "꽃밭", "해맞이", "별빛", "조용한곳",
        "신선한공기", "새소리", "물결", "해안", "은하수", "초록숲", "바람소리", "물고기", "올레길", "섬나라", "여유", "꿈나무", "수련원",
        "햇살가득", "마을길", "밭둑", "산속", "별장", "언덕", "모래사장", "숲속", "돌담", "햇볕", "맑은물", "모노톤", "동행", "순수",
        "작은언덕", "물길", "푸른초원", "갯벌", "고요한밤", "고운모래", "초록나무", "샘물", "산새소리", "한적한곳", "들판", "벚꽃나무",
        "정자", "구름다리", "백야", "푸른언덕", "동산", "분홍벚꽃", "낙엽", "물놀이", "골짜기", "소꿉장난", "농촌", "단풍나무", "골프장",
        "바닷가숲",
        "은은한조명", "밤하늘", "오솔길", "철새", "운치있는", "노을", "한가로운시간", "양떼목장", "해넘이", "안식처", "어린이동산", "빨간언덕",
        "성벽", "우물", "강가", "녹슨다리", "소규모농장", "우뚝선나무", "밤바다", "바다풍경", "수목원", "졸음", "모기소리", "안개",
        "어린이놀이터", "무지개", "동굴", "동산", "흔들의자", "흙집", "불꽃놀이"
    );

    private static Map<AccommodationType, String> accommodationSuffixPool =
        Map.of(AccommodationType.HOTEL, "호텔",
            AccommodationType.MOTEL, "모텔",
            AccommodationType.PENSION, "펜션",
            AccommodationType.RESORT, "리조트",
            AccommodationType.VILLA, "빌라"
        );

    public static String generateAccommodationName(AccommodationType type) {

        Random random = new Random();
        int prefixIndex = random.nextInt(accommodationPrefixPool.size());

        String prefix = accommodationPrefixPool.get(prefixIndex);

        return prefix + " " + accommodationSuffixPool.get(type);
    }


    private static List<String> couponNamePoll = List.of(
        "테스트쿠폰1", "테스트쿠폰2", "테스트쿠폰3", "테스트쿠폰4", "테스트쿠폰5", "테스트쿠폰6", "테스트쿠폰7", "테스트쿠폰8", "손님감사쿠폰",
        "따뜻한겨울쿠폰", "소중한당신쿠폰", "도심이벤트쿠폰", "성수기특가쿠폰", "호캉스특가쿠폰", "신상숙소쿠폰", "특급이벤트", "마음을담은선물쿠폰",
        "일주일휴가쿠폰", "동반자특가쿠폰", "가을바람할인쿠폰", "스페셜이벤트쿠폰", "풍경이좋은쿠폰", "EVENT", "밸런타인데이스페셜", "힐링휴가쿠폰",
        "업그레이드무료", "인생여행쿠폰", "바캉스특가쿠폰", "고객만족쿠폰", "미드나잇스페셜", "따스한이벤트", "2024특별이벤트", "여름이벤트",
        "수능이벤트", "신나는이벤트쿠폰", "프라이빗빌라쿠폰", "봄이벤트", "비즈니스트립10%", "Springevent", "재방문1000원", "모던디자인10%",
        "DOUBLEJOY23", "재방문고객", "ECOCHIC23", "봄봄할인", "로맨틱게스트쿠폰", "바다향쿠폰", "특별가족쿠폰", "여름신상3000",
        "주중스테이쿠폰", "단독이벤트쿠폰5000", "신나는불금1000원", "특별감사쿠폰", "기념일할인30%", "가족여행쿠폰2000", "스파플리스1000",
        "휴가떠나자5000", "장기투숙15%", "가족여행쿠폰5000", "오션뷰쿠폰", "신나는불금3000원", "여름신상20000", "럭셔리스테이3000",
        "소중한여행1000", "황금연휴10%", "첫방문고객스페셜", "휴가떠나자10%", "럭셔리스테이20000", "소중한여행30%", "장기투숙10%",
        "별이빛나는밤30%", "얼리버드특가", "당일예약15%", "소중한여행20000", "별이빛나는밤15%", "소중한여행40%", "산속숙소40%",
        "재방문 고객 15% 할인 쿠폰", "스파플리스30%", "10% 선착순 쿠폰", "빈티지스타일30%", "시그니처룸10%", "감사쿠폰2000",
        "당일예약2000원", "특급스윗룸15%", "황금연휴2000원", "프리미엄고객전용", "모든 고객 2000원 할인 쿠폰", "즉시할인쿠폰30%",
        "재방문 고객 3000 할인 쿠폰", "힐링쿠폰3000원", "친구모임10%", "5000원 선착순 쿠폰", "럭셔리스테이2000", "별이빛나는밤10%",
        "가족여행쿠폰50000", "단독이벤트쿠폰25%", "친구모임3000", "취향저격3000", "원데이스테이2000원", "여름신상30%", "시그니처룸25%",
        "휴가떠나자30%", "빈티지스타일15%", "단독이벤트쿠폰10%", "여름신상10%", "비즈니스트립15%", "하와이안스파2000원", "장기투숙3000원",
        "특급스윗룸30%", "친구모임1000", "모던디자인15%", "특급하우스2000원", "가족여행쿠폰10%", "스파플리스25%", "휴가떠나자3000",
        "하와이안스파3000원", "원데이스테이3000원", "특급하우스25%", "힐링쿠폰20000", "모든 고객 3000 할인 쿠폰", "신나는불금30%",
        "원데이스테이1000원", "첫방문고객 2000 할인 쿠폰", "하와이안스파20000", "산속숙소15%", "가족여행쿠폰20000", "당일예약20000",
        "산속숙소20000", "모던디자인 40%", "단독이벤트쿠폰2000", "가족여행쿠폰3000", "시그니처룸20%", "특급스윗룸2000", "하와이안스파30%",
        "여름신상2000원", "럭셔리스테이5000", "첫방문 고객2000 할인 쿠폰", "취향저격25%", "당일예약30%", "힐링쿠폰30%",
        "특급하우스1000원", "신혼부부쿠폰15%", "즉시할인쿠폰3000", "감사쿠폰15%", "황금연휴30%", "여름신상5000", "빈티지스타일2000",
        "소중한여행5000", "취향저격1000원", "모든고객3000원", "빈티지스타일25%", "기념일할인1000", "기념일할인2000원", "산속숙소25%",
        "2000원 선착순 쿠폰", "힐링쿠폰10%", "신혼부부쿠폰2000", "감사쿠폰1000", "취향저격2000원"
    );

    public static String generateCouponTitle() {
        return couponNamePoll.get(randomNum(0, couponNamePoll.size()));
    }


    public static Integer randomNum(int from, int to) {
        return (int) (Math.random() * to) + from;
    }

    private static List<String> roomNamePool = List.of(
        "비지니스 패밀리", "VIP 패밀리", "프리미엄 커플", "노멀 패밀리", "비지니스 패밀리", "VIP 트윈", "VIP 커플", "디럭스 더블",
        "VIP 커플", "노멀 더블", "노멀 패밀리", "프리미엄 트윈", "VIP 커플", "디럭스 더블", "비지니스 더블", "VIP 커플", "프리미엄 커플",
        "프리미엄 트윈", "프리미엄 트윈", "디럭스 더블"
    );

    private static List<String> roomNamePool2 = List.of(
        "코지 룸", "화이트", "하모니", "샌드", "레드", "스카이", "선셋", "토스카", "라임",
        "민트", "레인", "샤인", "블루", "레트로", "퍼플", "에코", "펜디", "엘리트", "골드", "헤이즐", "솔트", "셀렉", "퓨어",
        "릴랙스", "트렌디", "오션", "브라운", "루미너스", "브리즈", "오키드", "로지", "미스틱", "리틀", "페어리", "쏘피", "텐더", "레디",
        "티니", "제이드", "올리브"
    );

    private static List<String> roomNamePool3 = List.of(
        "101호", "102호", "103호", "104호", "105호", "106호", "107호", "108호", "109호", "110호", "201호",
        "202호", "203호", "204호", "205호", "206호", "207호", "208호", "209호", "210호", "301호", "302호",
        "303호", "304호", "305호", "306호", "307호", "308호", "309호", "310호", "401호", "402호", "403호",
        "404호", "405호", "406호", "407호", "408호", "409호", "410호", "501호", "502호", "503호", "504호",
        "505호", "506호", "507호", "508호", "509호", "510호"
    );

    public static List<String> getRoomNumberPool() {
        int num = randomNum(0, 3);
        if (num == 0) {
            return roomNamePool;
        } else if (num == 1) {
            return roomNamePool2;
        } else {
            return roomNamePool3;
        }
    }

    public static String generateRoomNumber(List<String> namePool) {
        return namePool.get(randomNum(0, namePool.size() - 1));
    }


}
