package com.coolpeace.domain.data.util;

import com.coolpeace.domain.accommodation.entity.Sido;
import com.coolpeace.domain.accommodation.entity.type.AccommodationType;
import java.util.List;
import java.util.Map;
import java.util.Random;

public class InfoGenerator {

    private static List<String> prefixPool = List.of(
        "로지","브리즈","코지","스위트","럭셔리","모션","터프","하버","마리나","로드하우스","레스토","스테이","러브","퍼스트","센트럴","캠프","세레니티","에스케이프","오아시스","헤이븐","캐슬","엔더스","워터프론트","스파","레트리트","코튼","블루스카이","그린","브루","섀도우","프리즘","햇살","포레스트","세븐","메이플","트랜센던스","몽고메리","플로랄","라이트","트로피컬","썬셋",
        "베이","디럭스","레드로즈","피크닉","엘리트","블리스","실버","썬라이즈","블랙다이아몬드","프로미스","샌드비치","미스틱","엑스클루시브","피아노","라운드","민트","로열","몽바니","스노우","그레이스","퍼펙트","로즈우드","트윈","크리스탈","미러","그린비","풍경","하이츠","데일리","헤어핀","엔티티","루나","아크","포폴","크로네","아티컬","더티","레몬","타임","휴식","힐스",
        "풋풋","하이브","스타일","포르테","이브","히어로","데코","에코","트레저","허니","크래프트","미니","메모리","노스","샬렛","미니멀","벨벳","워니","트렌디","팜","페스티벌","라이즌","스무드","크림","아티스트","빈티지","에어리","알로하","토파즈","세르브","미즈","빈","에피","엠버","씨블루","플루토","엔트로피","네온","프라임","스플래시","로드",
        "제니스","아이스","커버","빅토리","썬리치","픽셀","쿨링","아리아","엔젤","프린세스","펄","트랙","로켓","선셋","리버","스카이","컬러풀","코지랜드","모션픽","더블루","에메랄드","포토","루스","세븐세븐","바닐라","메티스","로프트","써니","루프","스카이라인","비스타","아메리칸","라디언트","메디","그린필드","소울","스윗플레이스","패밀리","아이엠","오퍼스","그로브",
        "듀얼","올드","제노시스","리틀","소피아","플로어","토마토","하트","로망틱","스트라이크","윈드","퓨처","블리","원더","모던","미티","로키","브루클린","트렌디플레이스","레퍼런스","미드나잇","라이블리","리얼","포스","스카니","산장","호수","녹음","천연","경관","소나무","목장","해변","강변","전망","푸른하늘","흰구름","꽃밭","해맞이","별빛","조용한곳",
        "신선한공기","새소리","물결","해안","은하수","초록숲","바람소리","물고기","올레길","섬나라","여유","꿈나무","수련원","햇살가득","마을길","밭둑","산속","별장","언덕","모래사장","숲속","돌담","햇볕","맑은물","모노톤","동행","순수","작은언덕","물길","푸른초원","갯벌","고요한밤","고운모래","초록나무","샘물","산새소리","한적한곳","들판","벚꽃나무","정자","구름다리",
        "백야","푸른언덕","동산","분홍벚꽃","낙엽","물놀이","골짜기","소꿉장난","농촌","단풍나무","골프장","바닷가숲","은은한조명","밤하늘","오솔길","철새","운치있는","노을","한가로운시간","양떼목장","해넘이","안식처","어린이동산","빨간언덕","성벽","우물","강가","녹슨다리","소규모농장","우뚝선나무","밤바다","바다풍경","수목원","졸음","모기소리","안개","어린이놀이터","무지개","동굴","동산","흔들의자","흙집","불꽃놀이"
    );

    private static Map<AccommodationType, String> suffixPool =
        Map.of(AccommodationType.HOTEL, "호텔",
            AccommodationType.MOTEL, "모텔",
            AccommodationType.PENSION, "펜션",
            AccommodationType.RESORT, "리조트",
            AccommodationType.VILLA, "빌라"
        );

    public static String generateName(AccommodationType type){

        Random random = new Random();
        int prefixIndex = random.nextInt(prefixPool.size());

        String prefix = prefixPool.get(prefixIndex);

        return prefix + " " + suffixPool.get(type);
    }




}
